In [53]:
import pandas as pd

In [55]:
df = pd.read_csv('sample_data.csv')

In [57]:
df

    Experience  Salary   Age
0            3   20000  27.0
1            4   28000  30.0
2            1   15000  38.0
3            8   40000  45.0
4            7   40000  33.0
5           10   50000   NaN
6           12   51000   NaN
7            2    9000  27.0
8           16   61000  40.0
9           21   98000  55.0
10          20   96000  50.0
11           4   27000  40.0
12           5   30000  51.0
13          16   60000   NaN
14          17   65000   NaN
15          25   99000  57.0
16          18   65000   NaN
17           6   31000  32.0
18           2   21000  30.0
19           8   36000  32.0

# 1. Create train_data and test_data

In [60]:
train_data = df[df['Age'].notnull()]
train_data

    Experience  Salary   Age
0            3   20000  27.0
1            4   28000  30.0
2            1   15000  38.0
3            8   40000  45.0
4            7   40000  33.0
7            2    9000  27.0
8           16   61000  40.0
9           21   98000  55.0
10          20   96000  50.0
11           4   27000  40.0
12           5   30000  51.0
15          25   99000  57.0
17           6   31000  32.0
18           2   21000  30.0
19           8   36000  32.0

In [63]:
train_data.shape

(15, 3)

In [66]:
test_data = df[df['Age'].isnull()]
test_data

    Experience  Salary  Age
5           10   50000  NaN
6           12   51000  NaN
13          16   60000  NaN
14          17   65000  NaN
16          18   65000  NaN

# 2. Create x_train and y_train from the train_data

In [68]:
x_train = train_data.drop('Age',axis=1)

In [77]:
y_train = train_data['Age']

In [72]:
x_train

    Experience  Salary
0            3   20000
1            4   28000
2            1   15000
3            8   40000
4            7   40000
7            2    9000
8           16   61000
9           21   98000
10          20   96000
11           4   27000
12           5   30000
15          25   99000
17           6   31000
18           2   21000
19           8   36000

In [74]:
x_train.shape

(15, 2)

In [79]:
y_train.shape

(15,)

# 4. Build a Linear Regression Model

In [81]:
from sklearn.linear_model import LinearRegression

In [83]:
lr = LinearRegression()

In [85]:
lr.fit(x_train,y_train)

LinearRegression()

# 5.Create the X_test from the test_data

In [87]:
X_test = test_data.drop('Age',axis=1)

# 6. Apply the model on X_test of test data and predict age

In [90]:
y_predict = lr.predict(X_test)
y_predict

array([41.10168261, 40.55946057, 42.1509794 , 43.60013026, 43.13787903])

# 7. Replace the Missing Values with predicted Values

In [109]:
test_data['Age'] = y_predict

/var/folders/92/_kz_fht558b0hh0627_7zzk00000gn/T/ipykernel_44603/1716583054.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  test_data['Age'] = y_predict

# 8. Combines Data

In [102]:
test_data

    Experience  Salary        Age
5           10   50000  41.101683
6           12   51000  40.559461
13          16   60000  42.150979
14          17   65000  43.600130
16          18   65000  43.137879

In [105]:
new_df = train_data.append(test_data)

/var/folders/92/_kz_fht558b0hh0627_7zzk00000gn/T/ipykernel_44603/602808170.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df = train_data.append(test_data)

In [108]:
new_df=new_df.sort_index(ascending=True)